:orange_circle:
sudo docker compose run --rm devops-utils sh -c 'cd components/session-manager; terraform plan -no-color -var-file="../../accounts/infrastructure/identity/var.tfvars"'
module.vpc.aws_route_table_association.public_asso[0]: Refreshing state... [id=rtbassoc-06c6fbc5e92f1bb9c]
module.vpc.module.tier["public_subnet"].aws_subnet.this[1]: Refreshing state... [id=subnet-0d7e674ce633ceab3]
module.vpc.aws_route_table_association.public_asso[1]: Refreshing state... [id=rtbassoc-0bc3e50fffa07dc91]
module.vpc.aws_route_table.public_rt: Refreshing state... [id=rtb-0e4b0f9845881122e]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-07a35b024555ea00e]
module.vpc.module.tier["public_subnet"].aws_subnet.this[2]: Refreshing state... [id=subnet-0bdf17d87760c47d6]
module.vpc.module.tier["public_subnet"].aws_subnet.this[0]: Refreshing state... [id=subnet-049ce40be4510c019]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-003093c661d5ee4d2]
module.vpc.aws_route_table_association.public_asso[2]: Refreshing state... [id=rtbassoc-08be30495f97e57ec]
module.vpc.aws_security_group.allow_SSH_HTTP: Refreshing state... [id=sg-0aa3b26ad88bc0fdd]
module.identity.data.aws_iam_policy.AmazonSSMManagedInstanceCore: Reading...
module.identity.data.aws_iam_policy.AmazonSSMManagedInstanceCore: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.identity.aws_iam_role.ssm_role will be created
  + resource "aws_iam_role" "ssm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ssm-arthur"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Owner" = "arthur"
        }
      + tags_all              = {
          + "Owner" = "arthur"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.identity.aws_iam_role_policy_attachment.SSM-role-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "SSM-role-policy-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ssm-arthur"
    }

  # module.vpc.aws_route_table.public_rt will be destroyed
  # (because aws_route_table.public_rt is not in configuration)
  - resource "aws_route_table" "public_rt" {
      - arn              = "arn:aws:ec2:ap-southeast-2:722141136946:route-table/rtb-0e4b0f9845881122e" -> null
      - id               = "rtb-0e4b0f9845881122e" -> null
      - owner_id         = "722141136946" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-003093c661d5ee4d2"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"  = "devops-vpc-public-rt"
          - "Owner" = "arthur"
        } -> null
      - tags_all         = {
          - "Name"  = "devops-vpc-public-rt"
          - "Owner" = "arthur"
        } -> null
      - vpc_id           = "vpc-07a35b024555ea00e" -> null
    }

  # module.vpc.aws_route_table_association.public_asso[0] will be destroyed
  # (because aws_route_table_association.public_asso is not in configuration)
  - resource "aws_route_table_association" "public_asso" {
      - id             = "rtbassoc-06c6fbc5e92f1bb9c" -> null
      - route_table_id = "rtb-0e4b0f9845881122e" -> null
      - subnet_id      = "subnet-049ce40be4510c019" -> null
    }

  # module.vpc.aws_route_table_association.public_asso[1] will be destroyed
  # (because aws_route_table_association.public_asso is not in configuration)
  - resource "aws_route_table_association" "public_asso" {
      - id             = "rtbassoc-0bc3e50fffa07dc91" -> null
      - route_table_id = "rtb-0e4b0f9845881122e" -> null
      - subnet_id      = "subnet-0d7e674ce633ceab3" -> null
    }

  # module.vpc.aws_route_table_association.public_asso[2] will be destroyed
  # (because aws_route_table_association.public_asso is not in configuration)
  - resource "aws_route_table_association" "public_asso" {
      - id             = "rtbassoc-08be30495f97e57ec" -> null
      - route_table_id = "rtb-0e4b0f9845881122e" -> null
      - subnet_id      = "subnet-0bdf17d87760c47d6" -> null
    }

  # module.vpc.aws_security_group.allow_SSH_HTTP will be destroyed
  # (because aws_security_group.allow_SSH_HTTP is not in configuration)
  - resource "aws_security_group" "allow_SSH_HTTP" {
      - arn                    = "arn:aws:ec2:ap-southeast-2:722141136946:security-group/sg-0aa3b26ad88bc0fdd" -> null
      - description            = "Allow TLS inbound traffic" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0aa3b26ad88bc0fdd" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "All Traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "SSH"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = []
              - description      = "Self SG"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> null
      - name                   = "allow_SSH_HTTP" -> null
      - owner_id               = "722141136946" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "allow_SSH_HTTP"
        } -> null
      - tags_all               = {
          - "Name" = "allow_SSH_HTTP"
        } -> null
      - vpc_id                 = "vpc-07a35b024555ea00e" -> null
    }

  # module.vpc.aws_vpc.this will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:ap-southeast-2:722141136946:vpc/vpc-07a35b024555ea00e" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0c1d21bd467d522ec" -> null
      - default_route_table_id               = "rtb-0c65fbf6da8aa34f6" -> null
      - default_security_group_id            = "sg-073f9efaaf025ba71" -> null
      - dhcp_options_id                      = "dopt-125e7875" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-07a35b024555ea00e" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0c65fbf6da8aa34f6" -> null
      - owner_id                             = "722141136946" -> null
      - tags                                 = {
          - "Name"  = "devops-vpc"
          - "Owner" = "arthur"
        } -> null
      - tags_all                             = {
          - "Name"  = "devops-vpc"
          - "Owner" = "arthur"
        } -> null
    }

  # module.vpc.module.tier["public_subnet"].aws_subnet.this[0] will be destroyed
  # (because aws_subnet.this is not in configuration)
  - resource "aws_subnet" "this" {
      - arn                                            = "arn:aws:ec2:ap-southeast-2:722141136946:subnet/subnet-049ce40be4510c019" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-2a" -> null
      - availability_zone_id                           = "apse2-az3" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-049ce40be4510c019" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "722141136946" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"  = "devops-vpc-public_subnet-a"
          - "Owner" = "arthur"
        } -> null
      - tags_all                                       = {
          - "Name"  = "devops-vpc-public_subnet-a"
          - "Owner" = "arthur"
        } -> null
      - vpc_id                                         = "vpc-07a35b024555ea00e" -> null
    }

  # module.vpc.module.tier["public_subnet"].aws_subnet.this[1] will be destroyed
  # (because aws_subnet.this is not in configuration)
  - resource "aws_subnet" "this" {
      - arn                                            = "arn:aws:ec2:ap-southeast-2:722141136946:subnet/subnet-0d7e674ce633ceab3" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-2b" -> null
      - availability_zone_id                           = "apse2-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d7e674ce633ceab3" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "722141136946" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"  = "devops-vpc-public_subnet-b"
          - "Owner" = "arthur"
        } -> null
      - tags_all                                       = {
          - "Name"  = "devops-vpc-public_subnet-b"
          - "Owner" = "arthur"
        } -> null
      - vpc_id                                         = "vpc-07a35b024555ea00e" -> null
    }

  # module.vpc.module.tier["public_subnet"].aws_subnet.this[2] will be destroyed
  # (because aws_subnet.this is not in configuration)
  - resource "aws_subnet" "this" {
      - arn                                            = "arn:aws:ec2:ap-southeast-2:722141136946:subnet/subnet-0bdf17d87760c47d6" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-2c" -> null
      - availability_zone_id                           = "apse2-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0bdf17d87760c47d6" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "722141136946" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"  = "devops-vpc-public_subnet-c"
          - "Owner" = "arthur"
        } -> null
      - tags_all                                       = {
          - "Name"  = "devops-vpc-public_subnet-c"
          - "Owner" = "arthur"
        } -> null
      - vpc_id                                         = "vpc-07a35b024555ea00e" -> null
    }

Plan: 2 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.